(define СИЛА (list->ff `(
   (0 . ,(list->ff '( ; людина
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (1 . ,(list->ff '( ; напівельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (2 . ,(list->ff '( ; ельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (3 . ,(list->ff '( ; хоббіт
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (4 . ,(list->ff '( ; карлик
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (5 . ,(list->ff '( ; гном
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (6 . ,(list->ff '( ; напіворк
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (7 . ,(list->ff '( ; напівтроль
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (8 . ,(list->ff '( ; дунадан
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (9 . ,(list->ff '( ; високий ельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (10 . ,(list->ff '( ; кобольд
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
)))

(define ІНТЕЛЕКТ (list->ff `(
   (0 . ,(list->ff '( ; людина
            (0 . -2) ; воїн
            (1 . +3) ; маг
            (2 . -3) ; священник
            (3 . +1) ; крадій
            (4 . +2) ; слідопит
            (5 . -3)))) ; паладін
   (1 . ,(list->ff '( ; напівельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (2 . ,(list->ff '( ; ельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (3 . ,(list->ff '( ; хоббіт
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (4 . ,(list->ff '( ; карлик
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (5 . ,(list->ff '( ; гном
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (6 . ,(list->ff '( ; напіворк
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (7 . ,(list->ff '( ; напівтроль
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (8 . ,(list->ff '( ; дунадан
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (9 . ,(list->ff '( ; високий ельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (10 . ,(list->ff '( ; кобольд
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
)))


(define МУДРІСТЬ (list->ff `(
   (0 . ,(list->ff '( ; людина
            (0 . -1) ; воїн
            (1 . -3) ; маг
            (2 . +3) ; священник
            (3 . -1) ; крадій
            (4 . +0) ; слідопит
            (5 . +2)))) ; паладін
   (1 . ,(list->ff '( ; напівельф
            (0 . -1) ; воїн
            (1 . -3) ; маг
            (2 . +3) ; священник
            (3 . -1) ; крадій
            (4 . +0) ; слідопит
            (5 . +2)))) ; паладін
   (2 . ,(list->ff '( ; ельф
            (0 . -1) ; воїн
            (1 . -3) ; маг
            (2 . +3) ; священник
            (3 . -1) ; крадій
            (4 . +0) ; слідопит
            (5 . +2)))) ; паладін
   (3 . ,(list->ff '( ; хоббіт
            (0 . -1) ; воїн
            (1 . -3) ; маг
            (2 . +3) ; священник
            (3 . -1) ; крадій
            (4 . +0) ; слідопит
            (5 . +2)))) ; паладін
   (4 . ,(list->ff '( ; карлик
            (0 . -1) ; воїн
            (1 . -3) ; маг
            (2 . +3) ; священник
            (3 . -1) ; крадій
            (4 . +0) ; слідопит
            (5 . +2)))) ; паладін
   (5 . ,(list->ff '( ; гном
            (0 . -1) ; воїн
            (1 . -3) ; маг
            (2 . +3) ; священник
            (3 . -1) ; крадій
            (4 . +0) ; слідопит
            (5 . +2)))) ; паладін
   (6 . ,(list->ff '( ; напіворк
            (0 . -1) ; воїн
            (1 . -3) ; маг
            (2 . +3) ; священник
            (3 . -1) ; крадій
            (4 . +0) ; слідопит
            (5 . +2)))) ; паладін
   (7 . ,(list->ff '( ; напівтроль
            (0 . -1) ; воїн
            (1 . -3) ; маг
            (2 . +3) ; священник
            (3 . -1) ; крадій
            (4 . +0) ; слідопит
            (5 . +2)))) ; паладін
   (8 . ,(list->ff '( ; дунадан
            (0 . -1) ; воїн
            (1 . -3) ; маг
            (2 . +3) ; священник
            (3 . -1) ; крадій
            (4 . +0) ; слідопит
            (5 . +2)))) ; паладін
   (9 . ,(list->ff '( ; високий ельф
            (0 . -1) ; воїн
            (1 . -3) ; маг
            (2 . +3) ; священник
            (3 . -1) ; крадій
            (4 . +0) ; слідопит
            (5 . +2)))) ; паладін
   (10 . ,(list->ff '( ; кобольд
            (0 . -1) ; воїн
            (1 . -3) ; маг
            (2 . +3) ; священник
            (3 . -1) ; крадій
            (4 . +0) ; слідопит
            (5 . +2)))) ; паладін
)))


(define СПРИТНІСТЬ (list->ff `(
   (0 . ,(list->ff '( ; людина
            (0 . -2) ; воїн
            (1 . +3) ; маг
            (2 . -3) ; священник
            (3 . +1) ; крадій
            (4 . +2) ; слідопит
            (5 . -3)))) ; паладін
   (1 . ,(list->ff '( ; напівельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (2 . ,(list->ff '( ; ельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (3 . ,(list->ff '( ; хоббіт
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (4 . ,(list->ff '( ; карлик
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (5 . ,(list->ff '( ; гном
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (6 . ,(list->ff '( ; напіворк
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (7 . ,(list->ff '( ; напівтроль
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (8 . ,(list->ff '( ; дунадан
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (9 . ,(list->ff '( ; високий ельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (10 . ,(list->ff '( ; кобольд
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
)))


(define ТІЛО (list->ff `(
   (0 . ,(list->ff '( ; людина
            (0 . -2) ; воїн
            (1 . +3) ; маг
            (2 . -3) ; священник
            (3 . +1) ; крадій
            (4 . +2) ; слідопит
            (5 . -3)))) ; паладін
   (1 . ,(list->ff '( ; напівельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (2 . ,(list->ff '( ; ельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (3 . ,(list->ff '( ; хоббіт
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (4 . ,(list->ff '( ; карлик
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (5 . ,(list->ff '( ; гном
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (6 . ,(list->ff '( ; напіворк
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (7 . ,(list->ff '( ; напівтроль
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (8 . ,(list->ff '( ; дунадан
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (9 . ,(list->ff '( ; високий ельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (10 . ,(list->ff '( ; кобольд
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
)))


(define ЧАРІВНІСТЬ (list->ff `(
   (0 . ,(list->ff '( ; людина
            (0 . -2) ; воїн
            (1 . +3) ; маг
            (2 . -3) ; священник
            (3 . +1) ; крадій
            (4 . +2) ; слідопит
            (5 . -3)))) ; паладін
   (1 . ,(list->ff '( ; напівельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (2 . ,(list->ff '( ; ельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (3 . ,(list->ff '( ; хоббіт
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (4 . ,(list->ff '( ; карлик
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (5 . ,(list->ff '( ; гном
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (6 . ,(list->ff '( ; напіворк
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (7 . ,(list->ff '( ; напівтроль
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (8 . ,(list->ff '( ; дунадан
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (9 . ,(list->ff '( ; високий ельф
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
   (10 . ,(list->ff '( ; кобольд
            (0 . +5) ; воїн
            (1 . -5) ; маг
            (2 . -1) ; священник
            (3 . +2) ; крадій
            (4 . +2) ; слідопит
            (5 . +3)))) ; паладін
)))



(define (get-сила раса клас)
   (define словник (get СИЛА раса #empty))
   (get словник клас #false))

(define (get-інтелект раса клас)
   (define словник (get ІНТЕЛЕКТ раса #empty))
   (get словник клас #false))

(define (get-мудрість раса клас)
   (define словник (get МУДРІСТЬ раса #empty))
   (get словник клас #false))

(define (get-спритність раса клас)
   (define словник (get СПРИТНІСТЬ раса #empty))
   (get словник клас #false))

(define (get-тіло раса клас)
   (define словник (get ТІЛО раса #empty))
   (get словник клас #false))

(define (get-чарівність раса клас)
   (define словник (get ЧАРІВНІСТЬ раса #empty))
   (get словник клас #false))