(define СИЛА (list->ff `(
   (0 . ,(list->ff '( ; людина
            (0 . +5) ; во
            (1 . -5) ; маг
            (2 . -1)
            (3 . +2)
            (4 . +2)
            (5 . +3))))
   (1 . ,(list->ff '(
            (0 . +15)
            (1 . -15) ; маг
            (2 . -11)
            (3 . +12)
            (4 . +12)
            (5 . +13))))
   (2 . ,(list->ff '(
            (0 . +5) ; во
            (1 . -5) ; маг
            (2 . -1)
            (3 . +2)
            (4 . +2)
            (5 . +3))))
   (3 . ,(list->ff '(
            (0 . +5)
            (1 . -5) ; маг
            (2 . -1)
            (3 . +2)
            (4 . +2)
            (5 . +3))))
            
)))

(define (get-сила раса клас)
   (define словник (get СИЛА раса #empty))
   (get словник клас #false))